БухЭксп/Catalogs/CW_ПлатежныеКалендари.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПлатежныеКалендари</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроизводственынйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВыходныеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблонЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВключитьВКалендарь</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДанныеПлатежногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДанныеПлатежногоКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПлатежныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлатежныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПлатежныеКалендари/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДниКалендаря 					= Новый ФиксированноеСоответствие(новый Соответствие);
	ДниПроизводственногоКалендаря 	= Новый ФиксированноеСоответствие(новый Соответствие);
	
	ГодКалендаря 			= Год(ТекущаяДата()); 
	ПредыдущийГодКалендаря 	= ГодКалендаря;
	
	ЗаполнитьДниНедели();
	ВариантЗаполненияПриИзмененииНаСервере();
	
	УстановитьИнтервалКалендаря();	
	
	ЗаполнитьДниКалендаря();
	ЗаполнитьДниПроизводственногоКалендаря();
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	
	Если МодифицированностьКалендаря Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриИзмененииГода", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Записть данные календаря?", Режим, 0);

		Возврат;
		
	Иначе
		УстановитьИнтервалКалендаря();	
		
		ЗаполнитьДниКалендаря();
		ЗаполнитьДниПроизводственногоКалендаря();
		
		Элементы.ДатаКалендаря.Обновить();
		
		ПредыдущийГодКалендаря = ГодКалендаря;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПриИзмененииГода(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	МодифицированностьКалендаря = ложь;
	Если Объект.Ссылка.Пустая() Тогда
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	ЗаписатьДанныеГрафикаВРегистр(Объект.Ссылка, ПредыдущийГодКалендаря);
	ПредыдущийГодКалендаря 		= ГодКалендаря;
	
	
	УстановитьИнтервалКалендаря();	
	
	ЗаполнитьДниКалендаря();
	ЗаполнитьДниПроизводственногоКалендаря();
	
	Элементы.ДатаКалендаря.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственынйКалендарьПриИзменении(Элемент)
	
	ЗаполнитьДниПроизводственногоКалендаря();
	
	Элементы.ДатаКалендаря.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ДатаКалендаряПриВыводеПериода(Элемент, ОформлениеПериода)
	
	Для Каждого СтрокаОформленияПериода Из ОформлениеПериода.Даты Цикл
		Если ДниКалендаря.Получить(СтрокаОформленияПериода.Дата) = Неопределено Тогда
			ЦветФона 	= Новый Цвет();
			Шрифт  		= Новый Шрифт();
		Иначе
			ЦветФона 	= ОбщегоНазначенияКлиент.ЦветСтиля("ДобавленныйРеквизитФон");
			Шрифт  		= Новый Шрифт(,,Истина);
		КонецЕсли;
		СтрокаОформленияПериода.ЦветФона 	= ЦветФона;
		СтрокаОформленияПериода.Шрифт 		= Шрифт;
		
		Если ДниПроизводственногоКалендаря.Получить(СтрокаОформленияПериода.Дата) = Неопределено Тогда
			ЦветТекстаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ВидДняПроизводственногоКалендаряНеУказанЦвет");
		Иначе
			ЦветТекстаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ВидДняПроизводственногоКалендаряРабочийЦвет");
		КонецЕсли;
		СтрокаОформленияПериода.ЦветТекста = ЦветТекстаДня;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьИнтервалКалендаря()
	
	НачалоГода 	= Дата(ГодКалендаря,1,1);
	КонецГода 	= Дата(ГодКалендаря,12,31);
	
	Элементы.ДатаКалендаря.НачалоПериодаОтображения = НачалоГода;
	Элементы.ДатаКалендаря.КонецПериодаОтображения  = КонецГода;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДниКалендаря()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДниСоответствие = Новый Соответствие;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДанныеПлатежногоКалендаря.Дата КАК Дата
	               |ИЗ
	               |	РегистрСведений.CW_ДанныеПлатежногоКалендаря КАК CW_ДанныеПлатежногоКалендаря
	               |ГДЕ
	               |	CW_ДанныеПлатежногоКалендаря.ПлатежныйКалендарь = &ПлатежныйКалендарь
	               |	И CW_ДанныеПлатежногоКалендаря.Год = &Год";
	
	Запрос.УстановитьПараметр("Год", 					ГодКалендаря);
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", 	Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДниСоответствие.Вставить(Выборка.Дата, Истина);
	КонецЦикла;
	
	ДниКалендаря = Новый ФиксированноеСоответствие(ДниСоответствие);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДниПроизводственногоКалендаря()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;  
	
	мВидыДней = ПолучитьМассивВидовРабочихДнейПроизводственногоКалендаря();
	
	ДниСоответствие = Новый Соответствие;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.Год = &Год
	               |	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	               |	И ДанныеПроизводственногоКалендаря.ВидДня В (&мВидыДней)";
	
	Запрос.УстановитьПараметр("Год", 						ГодКалендаря);
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", 	Объект.ПроизводственынйКалендарь);
	Запрос.УстановитьПараметр("мВидыДней", 					мВидыДней);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДниСоответствие.Вставить(Выборка.Дата, Истина);
	КонецЦикла;
	
	ДниПроизводственногоКалендаря = Новый ФиксированноеСоответствие(ДниСоответствие);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивВидовРабочихДнейПроизводственногоКалендаря()
	
	мВидыДней = новый Массив;
	мВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный"));
	мВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий"));
	
	Возврат мВидыДней;

КонецФункции

&НаСервере
Процедура ЗаполнитьДниНедели()
	
	ДниНедели.Добавить(1, 	"Понедельник");
	ДниНедели.Добавить(2, 	"Вторник");
	ДниНедели.Добавить(3, 	"Среда");
	ДниНедели.Добавить(4,	"Четверг");
	ДниНедели.Добавить(5, 	"Пятница");
	ДниНедели.Добавить(6, 	"Суббота");
	ДниНедели.Добавить(7,	"Воскресенье");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКалендаряВыбор(Элемент, ВыбраннаяДата)
	
	Если ДниКалендаря.Получить(ВыбраннаяДата) = Неопределено Тогда
		// Включаем в график
		ГрафикиРаботыКлиент.ВставитьВФиксированноеСоответствие(ДниКалендаря, ВыбраннаяДата, Истина);
	Иначе
		// Исключаем из графика
		ГрафикиРаботыКлиент.УдалитьИзФиксированногоСоответствия(ДниКалендаря, ВыбраннаяДата);
	КонецЕсли;
	
	МодифицированностьКалендаря = истина;
	
	Элементы.ДатаКалендаря.Обновить();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если МодифицированностьКалендаря Тогда
		ЗаписатьДанныеГрафикаВРегистр(ТекущийОбъект.Ссылка, ГодКалендаря);
		МодифицированностьКалендаря = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеГрафикаВРегистр(Календарь, Год)
	
	НаборДни = РегистрыСведений.CW_ДанныеПлатежногоКалендаря.СоздатьНаборЗаписей();
	НаборДни.Отбор.ПлатежныйКалендарь.Установить(Календарь);
	НаборДни.Отбор.Год.Установить(Год);
	НаборДни.Прочитать();
	НаборДни.Очистить();
	
	Для Каждого КлючЗначение из ДниКалендаря Цикл
		СтрокаНабора = НаборДни.Добавить();
		СтрокаНабора.ПлатежныйКалендарь = Календарь;
		СтрокаНабора.Год 				= Год;
		СтрокаНабора.Дата 				= КлючЗначение.Ключ;
	КонецЦикла;
	
	НаборДни.Записать(истина);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗаполнения(Команда)
	
	ПоказатьСкрытьПараметрыЗаполнения = Не ПоказатьСкрытьПараметрыЗаполнения;
	ПараметрыЗаполненияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗаполненияНаСервере()
	
	ДатаНачала = Дата(ГодКалендаря,1,1);
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметрыЗаполнения;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьКалендарь(Команда)
	
	Если Не ПроверитьЗаполнениеНастроек() Тогда
		ПоказатьПредупреждение(, "Не выполнена настройка заполнения!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКалендарьНаСервере();
	Элементы.ДатаКалендаря.Обновить();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКалендарь;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеНастроек()
	
	ЕстьОтметки = Ложь;
	
	Если Объект.ВариантЗаполнения = 0 Тогда
		Для Каждого ЭлементСписка из ДниНедели Цикл
			Если ЭлементСписка.Пометка Тогда
				ЕстьОтметки = истина;
			КонецЕсли;
		КонецЦикла;
	Иначеесли Объект.ВариантЗаполнения = 1 Тогда
		Для Каждого СтрокаШаблона из Объект.ШаблонЗаполнения Цикл
			Если СтрокаШаблона.ВключитьВКалендарь Тогда
				ЕстьОтметки = истина;
			КонецЕсли;
		КонецЦикла;
	Конецесли;
	
	Возврат ЕстьОтметки;
	
КонецФункции


&НаКлиенте
Процедура Назад(Команда)
	НазадНаСервере();
КонецПроцедуры

&НаСервере
Процедура НазадНаСервере()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКалендарь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКалендарьНаСервере()
	
	ДатаНачала = ?(ЗначениеЗаполнено(ДатаНачала), ДатаНачала, Дата(ГодКалендаря,1,1));

	мВидыДней = ПолучитьМассивВидовРабочихДнейПроизводственногоКалендаря();

	Соответствие = новый Соответствие;
	
	СоответствиеДниНедели =  Новый Соответствие;
	Для Каждого ЭлементСписка из ДниНедели Цикл
		СоответствиеДниНедели.Вставить(ЭлементСписка.Значение, ЭлементСписка.Пометка);
	КонецЦикла;
	
	СоответствиеШаблонЗаполнения =  Новый Соответствие;
	Для Каждого СтрокаШаблона из Объект.ШаблонЗаполнения Цикл
		СоответствиеШаблонЗаполнения.Вставить(СтрокаШаблона.НомерСтроки, СтрокаШаблона.ВключитьВКалендарь);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	               |	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	               |	И ДанныеПроизводственногоКалендаря.Год = &Год
	               |	И ДанныеПроизводственногоКалендаря.Дата >= &ДатаСтарта
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Год", 						ГодКалендаря);
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", 	Объект.ПроизводственынйКалендарь);
	Запрос.УстановитьПараметр("ДатаСтарта", 				ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если  Объект.ВариантЗаполнения = 0 Тогда ///По дням недели
		
		Пока Выборка.Следующий() Цикл
			
			ДобавитьВКалендарь = СоответствиеДниНедели.Получить(ДеньНедели(Выборка.Дата));
			ДобавитьВКалендарь = ?(ДобавитьВКалендарь = Неопределено, Ложь, ДобавитьВКалендарь);
			
			Если Объект.УчитыватьВыходныеДни и мВидыДней.Найти(Выборка.ВидДня) = Неопределено Тогда
				ДобавитьВКалендарь = ложь;
			КонецЕсли;
			
			Если Объект.УчитыватьНерабочиеДни 
				и Выборка.ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Нерабочий") Тогда
				ДобавитьВКалендарь = ложь;
			КонецЕсли;
			
			Если ДобавитьВКалендарь Тогда
				Соответствие.Вставить(Выборка.Дата, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Объект.ВариантЗаполнения = 1 Тогда ///По шаблону
		
		НомерДня = 1;
		Пока Выборка.Следующий() Цикл
			
			ДобавитьВКалендарь = СоответствиеШаблонЗаполнения.Получить(НомерДня);
			
			Если ДобавитьВКалендарь = Неопределено Тогда
				НомерДня = 1;
				ДобавитьВКалендарь = СоответствиеШаблонЗаполнения.Получить(НомерДня);
			КонецЕсли;
			
			Если Объект.УчитыватьВыходныеДни и мВидыДней.Найти(Выборка.ВидДня) = Неопределено Тогда
				ДобавитьВКалендарь = ложь;
			КонецЕсли;
			
			Если Объект.УчитыватьНерабочиеДни 
				и Выборка.ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Нерабочий") Тогда
				ДобавитьВКалендарь = ложь;
			КонецЕсли;
			
			Если ДобавитьВКалендарь Тогда
				Соответствие.Вставить(Выборка.Дата, Истина);
			КонецЕсли;
			
			НомерДня = НомерДня + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДниКалендаря = новый ФиксированноеСоответствие(Соответствие);
	
	МодифицированностьКалендаря = истина;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантЗаполненияПриИзменении(Элемент)
	ВариантЗаполненияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВариантЗаполненияПриИзмененииНаСервере()
	
	Элементы.ДниНедели.Видимость 		= Объект.ВариантЗаполнения = 0;
	Элементы.ШаблонЗаполнения.Видимость = Объект.ВариантЗаполнения = 1;
	
КонецПроцедуры
